LCS_Testcases/LCS_Testcase_cavity2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        nFaces          60;
        startFace       7080;
    }
    fixedWalls
    {
        type            wall;
        nFaces          180;
        startFace       7140;
    }
    frontAndBack
    {
        type            empty;
        nFaces          7200;
        startFace       7320;
    }
)


// ************************************************************************* //
